/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tkirihar <tkirihar@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/08 16:06:12 by tkirihar          #+#    #+#             */
/*   Updated: 2022/01/13 20:57:21 by tkirihar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libphilo.h"

/* 引数がアルファベットor数字の0~9であるか確認する関数 */
int	ft_isalnum(char c)
{
	return (ft_isdigit(c) || ft_isalpha(c));
}
